تست جعبه سفید (White-box Testing)

در این نوع تست با مکانیسم داخلی و متدهای یک سیستم سرو کار داریم. به این نوع تست structural تست نیز گفته می‌شود.

تست جعبه سیاه (Black-box Testing)

در این رویکرد‌، تست تمامی مکانیسم‌های داخلی یک سیستم نادیده گرفته می‌شود و روی خروجی تولید شده تمرکز می‌شود.به این رویکرد تست functional نیز می‌گویند

======

یونیت تستینگ (Unit Testing)

در این نوع تست ما یک واحد و یا یک گروه از واحد‌های مرتبط با هم را تست می‌کنیم. این نوع تست زیر مجموعه White-box Testing است.

اینتگریشن تستینگ (Integration Testing)

این نوع تست به ما این امکان را می‌دهد که چند نوع کامپننت مختلف را کنار یکدیگر تست کنیم. در این صورت حتی ما می‌توانیم وابستگی‌های میان سخت افزار و نرم افزار را نیز تست کنیم. این دسته از تست‌ها زیر مجموعه black box هستند.

فانکشنال تستینگ (Functional Testing)

در این تست اطمینان حاصل می‌شود که عملکرد برنامه به درستی است.توجه شود که در این نوع تست برخلاف آزمون واحد ما می‌توانیم عملکرد یک سیستم را تست کنیم و نه فقط یک واحد را.این تست زیر مجموعه black box هستند.

سیستم تستینگ (System Testing)

این نوع تست به ما اجازه می‌دهد که از عملکرد برنامه در محیطهای مختلف اطمینان حاصل کنیم(مثل سیستم عامل های مختلف). این تست زیر مجموعه black box تست‌ها است.

استرس تستینگ (Stress Testing)

این نوع تست عملکرد برنامه را در شرایط نا مطلوب مورد بررسی قرار می‌دهد. این تست زیر مجموعه black box تست‌ها است.

پرفورمنس تستینگ (Performance Testing)

تست عملکرد و کارایی که در مجموعه black box تست‌ها جای میگیرد به ما این اطمینان را می‌دهد که برنامه مان عملکرد و کارایی لازم را در یک مدت زمان مشخص داراست.

یوزیبیلیتی تستینگ (Usability Testing)

این تست از دیدگاه مشتری انجام می‌شود و در واقع مشخص کننده فاکتورهای زیر است:

آیا برنامه کاربر پسند است؟

آیا برنامه ساده و قابل یادگیری است؟

آیا برنامه جذاب طراحی شده است؟

و …

این نوع تست زیر مجموعه black box تست‌ها است.

اکسپتنس تستینگ (Acceptance Testing)

این نوع تست معمولا از طرف مشتری انجام می‌شود.هدف آن، مشخص کردن این است که آیا برنامه نیازهای مشتری را پاسخ می‌دهد و آیا برنامه همان چیزی که مشتری می‌خواهد هست یا خیر.

رگرشن تستینگ (Regression Testing)

این نوع تست به منظور صحت عملکرد سیستم بعد از تغییرات استفاده می‌شود و زیر مجموعه black box تست‌ها است.

بتا تستینگ (Beta Testing)

تستی است که توسط کاربر نهایی یا یک تیم خارج از تیم توسعه انجام می‌شود.هدف تست بتا پوشش دادن خطاهای غیر منتظره است.این تست زیر مجموعه black box تست‌ها است.
